jeffrey070318/MSPM0G3507_BASIC-/MSPM0G3507_BASIC.syscfg
/**
 * AI AGENTS: Do not edit this file directly. There is no validation or error feedback when
 * editing manually — mistakes will be silent until the file is loaded in SysConfig.
 * Use the SysConfig MCP server instead to make changes with immediate error reporting.
 *
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --device "MSPM0G350X" --part "Default" --package "LQFP-64(PM)" --product "mspm0_sdk@2.10.00.04"
 * @v2CliArgs --device "MSPM0G3507" --package "LQFP-64(PM)" --product "mspm0_sdk@2.10.00.04"
 * @versions {"tool":"1.28.0+4712"}
 */

/**
 * Import the modules used in this configuration.
 */
const CRC           = scripting.addModule("/ti/driverlib/CRC");
const DMA           = scripting.addModule("/ti/driverlib/DMA");
const GPIO          = scripting.addModule("/ti/driverlib/GPIO", {}, false);
const GPIO1         = GPIO.addInstance();
const GPIO2         = GPIO.addInstance();
const GPIO3         = GPIO.addInstance();
const GPIO4         = GPIO.addInstance();
const GPIO5         = GPIO.addInstance();
const GPIO6         = GPIO.addInstance();
const GPIO7         = GPIO.addInstance();
const GPIO8         = GPIO.addInstance();
const GPIO9         = GPIO.addInstance();
const GPIO10        = GPIO.addInstance();
const I2C           = scripting.addModule("/ti/driverlib/I2C", {}, false);
const I2C1          = I2C.addInstance();
const I2C2          = I2C.addInstance();
const PWM           = scripting.addModule("/ti/driverlib/PWM", {}, false);
const PWM1          = PWM.addInstance();
const PWM2          = PWM.addInstance();
const PWM3          = PWM.addInstance();
const SYSCTL        = scripting.addModule("/ti/driverlib/SYSCTL");
const SYSTICK       = scripting.addModule("/ti/driverlib/SYSTICK");
const TIMER         = scripting.addModule("/ti/driverlib/TIMER", {}, false);
const TIMER1        = TIMER.addInstance();
const UART          = scripting.addModule("/ti/driverlib/UART", {}, false);
const UART1         = UART.addInstance();
const UART2         = UART.addInstance();
const UART3         = UART.addInstance();
const ProjectConfig = scripting.addModule("/ti/project_config/ProjectConfig");

/**
 * Write custom configuration values to the imported modules.
 */
const divider6       = system.clockTree["PLL_CLK2X_DIV"];
divider6.divideValue = 4;

const divider9       = system.clockTree["UDIV"];
divider9.divideValue = 2;

const multiplier2         = system.clockTree["PLL_QDIV"];
multiplier2.multiplyValue = 5;

const mux8       = system.clockTree["HSCLKMUX"];
mux8.inputSelect = "HSCLKMUX_SYSPLL2X";


const Board = scripting.addModule("/ti/driverlib/Board", {}, false);

GPIO1.$name                         = "MOTOR_GPIO";
GPIO1.associatedPins.create(4);
GPIO1.associatedPins[0].$name       = "AIN1";
GPIO1.associatedPins[0].pin.$assign = "PA17";
GPIO1.associatedPins[1].$name       = "AIN2";
GPIO1.associatedPins[1].pin.$assign = "PA16";
GPIO1.associatedPins[2].$name       = "BIN1";
GPIO1.associatedPins[2].pin.$assign = "PB4";
GPIO1.associatedPins[3].$name       = "BIN2";
GPIO1.associatedPins[3].pin.$assign = "PB1";

GPIO2.$name                         = "LED_GPIO";
GPIO2.associatedPins.create(3);
GPIO2.associatedPins[0].$name       = "LED3";
GPIO2.associatedPins[0].pin.$assign = "PB25";
GPIO2.associatedPins[1].$name       = "LED4";
GPIO2.associatedPins[1].pin.$assign = "PB26";
GPIO2.associatedPins[2].$name       = "BOARD_LED";
GPIO2.associatedPins[2].pin.$assign = "PB22";

GPIO3.$name                         = "BUZZER_GPIO";
GPIO3.associatedPins[0].$name       = "BUZZER";
GPIO3.associatedPins[0].initialValue = "SET";
GPIO3.associatedPins[0].pin.$assign = "PB13";

GPIO4.$name                         = "TRIG_GPIO";
GPIO4.associatedPins[0].$name       = "TRIG";
GPIO4.associatedPins[0].pin.$assign = "PB14";

GPIO5.$name                         = "KEY_GPIO";
GPIO5.associatedPins.create(3);
GPIO5.associatedPins[0].direction   = "INPUT";
GPIO5.associatedPins[0].$name       = "KEY1";
GPIO5.associatedPins[0].pin.$assign = "PB16";
GPIO5.associatedPins[1].direction   = "INPUT";
GPIO5.associatedPins[1].$name       = "KEY2";
GPIO5.associatedPins[1].pin.$assign = "PA14";
GPIO5.associatedPins[2].direction   = "INPUT";
GPIO5.associatedPins[2].$name       = "KEY3";
GPIO5.associatedPins[2].pin.$assign = "PA15";

GPIO6.$name                         = "GRAY_SENSOR_GPIO";
GPIO6.associatedPins.create(4);
GPIO6.associatedPins[0].$name       = "AD0";
GPIO6.associatedPins[0].pin.$assign = "PB18";
GPIO6.associatedPins[1].$name       = "AD1";
GPIO6.associatedPins[1].pin.$assign = "PB17";
GPIO6.associatedPins[2].$name       = "AD2";
GPIO6.associatedPins[2].pin.$assign = "PB19";
GPIO6.associatedPins[3].$name       = "OUT";
GPIO6.associatedPins[3].direction   = "INPUT";
GPIO6.associatedPins[3].pin.$assign = "PB24";

GPIO7.$name                         = "MPU_GPIO";
GPIO7.associatedPins[0].$name       = "MPU_INT";
GPIO7.associatedPins[0].direction   = "INPUT";
GPIO7.associatedPins[0].pin.$assign = "PA25";

GPIO8.$name                         = "ENCODER_GPIO";
GPIO8.associatedPins.create(4);
GPIO8.associatedPins[0].$name       = "ENC_L_A";
GPIO8.associatedPins[0].direction   = "INPUT";
GPIO8.associatedPins[0].interruptEn = true;
GPIO8.associatedPins[0].polarity    = "RISE_FALL";
GPIO8.associatedPins[0].pin.$assign = "PA12";
GPIO8.associatedPins[1].$name       = "ENC_L_B";
GPIO8.associatedPins[1].direction   = "INPUT";
GPIO8.associatedPins[1].interruptEn = true;
GPIO8.associatedPins[1].polarity    = "RISE_FALL";
GPIO8.associatedPins[1].pin.$assign = "PA13";
GPIO8.associatedPins[2].$name       = "ENC_R_A";
GPIO8.associatedPins[2].direction   = "INPUT";
GPIO8.associatedPins[2].interruptEn = true;
GPIO8.associatedPins[2].polarity    = "RISE_FALL";
GPIO8.associatedPins[2].pin.$assign = "PB20";
GPIO8.associatedPins[3].$name       = "ENC_R_B";
GPIO8.associatedPins[3].direction   = "INPUT";
GPIO8.associatedPins[3].interruptEn = true;
GPIO8.associatedPins[3].polarity    = "RISE_FALL";
GPIO8.associatedPins[3].pin.$assign = "PB23";

